In [5]:
import pandas as pd

In [6]:
# Import pandas
import pandas as pd

# Ensure 'data' is defined
data = pd.read_table('http://bit.ly/movieusers', sep='|')

# Combine the columns into a single string column
data['combined'] = data.astype(str).agg('|'.join, axis=1)

# Split the combined column into multiple columns
data_split = data['combined'].str.split('|', expand=True)

# Select only the first 5 columns to match the expected column names
data_split = data_split.iloc[:, :5]
data_split.columns = ['ID', 'Age', 'Gender', 'Occupation', 'Zipcode']

# Ensure the data variable is used correctly
random_variables = data_split['Age'].astype(int)  # Convert 'Age' to integer
Q1 = random_variables.quantile(0.25)
Q2 = random_variables.quantile(0.50)   # Median
Q3 = random_variables.quantile(0.75)
IQR = Q3 - Q1
print (f"Q1: {Q1},\n Q2: {Q2},\n Q3: {Q3},\n IQR: {IQR}")
# Calculate the lower and upper fences for outliers
lower_fence = Q1 - 1.5 * IQR
upper_fence = Q3 + 1.5 * IQR
print(f"Any number below {lower_fence} or above {upper_fence} is an outlier")

Q1: 25.0,
 Q2: 31.0,
 Q3: 43.0,
 IQR: 18.0
Any number below -2.0 or above 70.0 is an outlier

In [7]:
#to read table from link or you can put the path of your own table
data=pd.read_table('http://bit.ly/movieusers')
data.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [8]:
type(data)

pandas.core.frame.DataFrame

In [9]:
data.head() #first 5 rows of the data
#to read table from link or you can put the path of your own table

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [10]:
data.tail() #last 5 rows of the data

          1|24|M|technician|85711
937        939|26|F|student|33319
938  940|32|M|administrator|02215
939        941|20|M|student|97229
940      942|48|F|librarian|78209
941        943|22|M|student|77841

In [11]:
data=pd.read_table('http://bit.ly/movieusers',sep = '|')
data.head() #first 5 rows of the data

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

In [12]:
data=pd.read_table('http://bit.ly/movieusers',sep = '|', header=None) #using header=None and sep='|' to read the table
data.head() #first 5 rows of the data

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [13]:
header_columns = ['index','gender', 'department', 'postal_code']
data = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=header_columns) #using header=None and sep='|' to read the table
data.head() #first 5 rows of the data

   index gender  department postal_code
1     24      M  technician       85711
2     53      F       other       94043
3     23      M      writer       32067
4     24      M  technician       43537
5     33      F       other       15213

In [14]:
user_info = pd.read_csv('http://bit.ly/uforeports')

In [15]:
print(type(user_info)) #to check the type of the data
user_info.head() #first 5 rows of the data

<class 'pandas.core.frame.DataFrame'>

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [16]:
user_info['City'].head() #to check the first 5 rows of the column 'City'

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [17]:
user_info['Colors Reported'].tail() #to check the last 5 rows of the column 'Colors Reported'
#because the column 'Colors Reported' has a spaces in its name so we only can use this method.

18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, dtype: object

In [18]:
user_info.State.tail() #to check the last 5 rows of the column 'State'

18236    IL
18237    IA
18238    WI
18239    WI
18240    FL
Name: State, dtype: object

In [19]:
user_info.shape #to check the shape of the data

(18241, 5)

In [20]:
user_info.columns #to check the columns of the data

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [21]:
user_info['Location']= user_info['City'] + ', ' + user_info['State'] #to create a new column 'Location' by combining the columns 'City' and 'State'
user_info.head() #first 5 rows of the data

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [22]:
user_info.to_csv('newfile.csv', index=False) #to save the data to a new file 'newfile.csv' without the index

In [23]:
# Save the data to an Excel file with a different name to avoid permission issues
user_info.to_excel("D:\AI & Machine Learning\CREATIVA_25_AI\pandas_data_frame_new.xlsx", index=False)  # Ensure the path is correct

<>:2: SyntaxWarning: invalid escape sequence '\A'
<>:2: SyntaxWarning: invalid escape sequence '\A'
C:\Users\Menna\AppData\Local\Temp\ipykernel_12072\1711837155.py:2: SyntaxWarning: invalid escape sequence '\A'
  user_info.to_excel("D:\AI & Machine Learning\CREATIVA_25_AI\pandas_data_frame_new.xlsx", index=False)  # Ensure the path is correct

In [24]:
new_file = pd.read_csv('./newfile.csv') #to read the new file 'newfile.csv'
new_file.head() #first 5 rows of the new file

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [25]:
new_file.describe() #to check the description of the new file

,City,Colors Reported,Shape Reported,State,Time,Location
count,18215,2882,15597,18241,18241,18215
unique,6475,27,27,52,16145,8028
top,Seattle,RED,LIGHT,CA,11/16/1999 19:00,"Seattle, WA"
freq,187,780,2803,2529,27,187

In [26]:
new_file.dtypes #to check the data types of the new file

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
Location           object
dtype: object

In [27]:
new_file[0:10] #to check the first 10 rows of the new file

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"
5,Valley City,NaN,DISK,ND,9/15/1934 15:30,"Valley City, ND"
6,Crater Lake,NaN,CIRCLE,CA,6/15/1935 0:00,"Crater Lake, CA"
7,Alma,NaN,DISK,MI,7/15/1936 0:00,"Alma, MI"
8,Eklutna,NaN,CIGAR,AK,10/15/1936 17:00,"Eklutna, AK"
9,Hubbard,NaN,CYLINDER,OR,6/15/1937 0:00,"Hubbard, OR"

In [28]:
new_file.info() #to check the information of the new file

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18215 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
 5   Location         18215 non-null  object
dtypes: object(6)
memory usage: 855.2+ KB

In [29]:
new_file.rename(columns={'Colors Reported': 'Colors_Reported'}, inplace=True) #to rename the column 'Colors Reported' to 'Colors_Reported'
new_file.head() #first 5 rows of the new file

,City,Colors_Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [30]:
new_file.columns = new_file.columns.str.replace(' ', '_') #to replace the spaces in the column names with '_'
new_file.columns #to check the columns of the new file

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time',
       'Location'],
      dtype='object')

In [31]:
new_file.drop(columns=['Colors_Reported'], inplace=True) #to drop the column 'Colors Reported'
new_file.head() #first 5 rows of the new file

,City,Shape_Reported,State,Time,Location
0,Ithaca,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [38]:
# Ensure 'new_file' is defined by re-importing it
new_file = pd.read_csv('./newfile.csv')  # Load the new file 'newfile.csv'
unique_values = new_file.nunique()  # Check the number of unique values in the new file
unique_values  # Display the result

City                6475
Colors Reported       27
Shape Reported        27
State                 52
Time               16145
Location            8028
dtype: int64